
Процедура СоздатьСписокНаСервере(Договоры, Период) Экспорт
	
	Всего = Договоры.Количество();
	Сч = 0;
	
	Для Каждого Договор Из Договоры Цикл
		  ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		  ДокОбъект.Дата = КонецМесяца(Период);
		  ДокОбъект.Организация = Договор.Организация;
		  ДокОбъект.Контрагент = Договор.Контрагент;
		  ДокОбъект.Договор = Договор.Ссылка;
		  ДокОбъект.Комментарий = "Документ создан при помощи обработки 'Массовое создание актов'";
		  ДокОбъект.Ответственный = Пользователи.ТекущийПользователь();
		  
		  ДокОбъект.ВКМ_ВыполнитьАвтозаполнение();
		  
		  Если ДокОбъект.Услуги.Количество() <> 0 Тогда
			  ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		  КонецЕсли;
		  
		  Сч = Сч + 1;
		  ДлительныеОперации.СообщитьПрогресс(Сч/Всего * 100);
	КонецЦикла
		
КонецПроцедуры