
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрока Из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		
		Сутки = 60 * 60 * 24;
		ДатаНачалаОтпуска = НачалоДня(ТекСтрока.ДатаНачала);
		ДатаОкончанияОтпуска = НачалоДня(ТекСтрока.ДатаОкончания);
		КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
		
		Движение.КоличествоДнейОтпускаПлан = КоличествоДнейОтпуска;

	КонецЦикла;

КонецПроцедуры
