
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Сутки = 60 * 60 * 24;
	ДатаНачалаОтпуска = НачалоДня(ТекущаяСтрока.ДатаНачала);
	ДатаОкончанияОтпуска = НачалоДня(ТекущаяСтрока.ДатаОкончания);
	КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
	ТекущаяСтрока.КоличествоДнейОтпуска = КоличествоДнейОтпуска;
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сутки = 60 * 60 * 24;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ДатаНачалаОтпуска = НачалоДня(Строка.ДатаНачала);
		ДатаОкончанияОтпуска = НачалоДня(Строка.ДатаОкончания);
		Строка.КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	Структура = Новый Структура();
	Структура.Вставить("Год", Объект.Год);
	Структура.Вставить("ТаблицаОтпусков", Объект.ОтпускаСотрудников.Выгрузить());
	
	Данные = ПоместитьВоВременноеХранилище(Структура, Новый УникальныйИдентификатор);
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	
	Имя = ПолучитьПолноеИмяФормы("АнализГрафика");
	
	ОткрытьФорму(Имя, СтруктураПараметров, ЭтотОбъект);
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьПолноеИмяФормы(ИмяФормы)
	
	 СимволТочка = ".";
	 ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
	 
	 Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл
		 ПозицияТочки = ПозицияТочки - 1;
	 КонецЦикла;
	 
	 Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;
	 
КонецФункции


