
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		ВывестиНовыеЭлементыНаФорму(ЭтотОбъект);		
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
		ВывестиНовыеЭлементыНаФорму(ЭтотОбъект);		
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиНовыеЭлементыНаФорму(Форма)
	
	Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")Тогда
		Форма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		Форма.Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Форма.Элементы.ВКМ_Дата.Видимость = Истина;
		Форма.Элементы.ВКМ_СрокДействия.Видимость = Истина;
	Иначе
		Форма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		Форма.Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Форма.Элементы.ВКМ_Дата.Видимость = Ложь;
		Форма.Элементы.ВКМ_СрокДействия.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

































